{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 17], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "activation": "linear", "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "activation": "linear", "units": 5, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "dtype": "float32"}, "name": "leaky_re_lu_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "noise_shape": null, "rate": 0.2, "name": "dropout_1", "seed": null}, "name": "dropout_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "activation": "sigmoid", "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3"}, "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.3.1"}